app/Controllers/Dashboard.php

    public function index(): string
    {
        $session = session();

        // Cek apakah pengguna sudah login
        if (!$session->get('logged_in')) {
            return redirect()->to('/login'); // Redirect ke halaman login jika tidak login
        }

        // Mengambil jumlah data dari database
        $modelProduk = new ModelProduk();
        $modelKategori = new ModelKategori();
        $modelSatuan = new ModelSatuan();
        $modelUser = new ModelUser();

        $data = [
            'judul' => 'Dashboard',
            'subjudul' => '',
            'menu' => 'dashboard',
            'submenu' => '',
            'page' => 'v_dashboard',
            'produkCount' => $modelProduk->countAll(),
            'kategoriCount' => $modelKategori->countAll(),
            'satuanCount' => $modelSatuan->countAll(),
            'userCount' => $modelUser->countAll(),
---
SELECT COUNT(*) AS `numrows` FROM `tb_produk`
SELECT COUNT(*) AS `numrows` FROM `tb_kategori`
SELECT COUNT(*) AS `numrows` FROM `tb_satuan`
SELECT COUNT(*) AS `numrows` FROM `tb_user`