app/Controllers/Kategori.php

SELECT *
FROM `tb_kategori`
---
    public function index(): string
    {
         // Memanggil ModelSatuan
         $modelKategori = new ModelKategori();

         // Mengambil semua data satuan
         $kategori = $modelKategori->findAll();