app/Controllers/Penjualan.php

    private function generateInvoiceNumber()
    {
        $modelPenjualan = new ModelPenjualan();

        // Ambil data terakhir dari tabel penjualan
        $lastInvoice = $modelPenjualan->orderBy('id_jual', 'DESC')->first();
---
SELECT *
FROM `tb_jual`
ORDER BY `id_jual` DESC
 LIMIT 1

    public function simpan()
    {
        $modelPenjualan = new ModelPenjualan();
        $lastFaktur = $modelPenjualan->getLastFaktur(); // Ambil nomor faktur terakhir

        // Generate nomor faktur baru
        $newFaktur = $this->generateNewFaktur($lastFaktur ? $lastFaktur['no_faktur'] : null);

        $data = [
            'no_faktur' => $newFaktur,
            'tgl_jual' => date("Y-m-d"),
            'jam' => date("H:i:s"),
            'total' => $this->request->getPost('total'),
            'bayar' => $this->request->getPost('bayar'),
            'kembalian' => $this->request->getPost('kembalian'),
            'id_kasir' => session()->get('id_user') // Misal ambil dari session
        ];

        if ($modelPenjualan->insert($data)) {
---
INSERT INTO `tb_jual` (`no_faktur`, `tgl_jual`, `jam`, `total`, `bayar`, `kembalian`, `id_kasir`) VALUES ('IN0008', '2024-11-12', '20:04:26', '3000000', '3000000', '0', '2')