app/Controllers/Produk.php

    public function index(): string
    {
        $modelProduk = new ModelProduk();
        $modelKategori = new ModelKategori();
        $modelSatuan = new ModelSatuan();

        // Mengambil semua data produk dengan detail kategori dan satuan
        $produk = $modelProduk->getProdukWithDetails();
        $kategori = $modelKategori->findAll();
        $satuan = $modelSatuan->findAll();
---
SELECT *
FROM `tb_kategori`
SELECT *
FROM `tb_satuan`