app/Models/ModelPenjualan.php

    public function getLastFaktur()
    {
        return $this->select('no_faktur')
            ->orderBy('id_jual', 'DESC')
            ->first();
---
SELECT `no_faktur`
FROM `tb_jual`
ORDER BY `id_jual` DESC
 LIMIT 1