app/Models/ModelProduk.php

SELECT `tb_produk`.*, `tb_kategori`.`nama_kategori`, `tb_satuan`.`nama_satuan`
FROM `tb_produk`
JOIN `tb_kategori` ON `tb_kategori`.`id_kategori` = `tb_produk`.`id_kategori`
JOIN `tb_satuan` ON `tb_satuan`.`id_satuan` = `tb_produk`.`id_satuan`
---
    public function getProdukWithDetails()
    {
        return $this->select('tb_produk.*, tb_kategori.nama_kategori, tb_satuan.nama_satuan')
            ->join('tb_kategori', 'tb_kategori.id_kategori = tb_produk.id_kategori')
            ->join('tb_satuan', 'tb_satuan.id_satuan = tb_produk.id_satuan')
            ->findAll();