app/Models/ModelUser.php

SELECT *
FROM `tb_user`
WHERE `nama_user` = 'admin'
 LIMIT 1
---
    public function getUserByUsername($username)
    {
        return $this->where('nama_user', $username)->first();